// // 1. Використовуючи if...else напиши код, який буде запитувати у користувача "Яка офіційна назва JavaScript?".
//    Якщо користувач вводить "ECMAScript", то показати за допомогою alert("Вірно!")
//    У інших випадках показати "Не знаєте? ECMAScript!"

// 3. Напишіть цикл, який виводить у консоль числа від max до min у порядку зменшення.
// У консоль виведіть усі парні числа від min до max


// 4. За допомогою цикла for додайте всі парні числа від min до max

// const numberMin = 6;
// const numberMax = 123;
// let total = 0;
// for (let i = numberMin; i <= numberMax; i += 1) {
//     // if (i % 2 === 0) {     total += i; }//
//     console.log(total);
//     if(i%2!==0){
//    continue
//     }
//     total += i
// }
// console.log(total);

// 5. При завантаженні сторінки користувачу пропонується у prompt ввести число.
//     Те, що вводить користувач, додається до значення змінної total.
// Операція вводу числа триває до тих пір, поки користувач не натисне кнопку Cancel в prompt.
// Після того, як користувач припинив вводити числа і натиснув на кнопку Cancel,
//     показувати alert з рядком "Загальна сума введених чисел дорівнює [число]."
// Робити перевірку, що користувач ввів саме число, а не довільні символи, не потрібно.

// let question = prompt('Введіть число, або нажміть Cansel');
// let total = 0;
// // let end = false;
// do {if (question){
//     total += Number(question);
//     // end = true;
//     // console.log(question, total);
//    question = prompt('Введіть число, або нажміть Cansel');
// } else {console.log(total);}
// } while (question);
   
// 6. Напиши код, який буде запитувати логін за допомогою prompt та логувати результат у консоль браузера.
// Якщо користувач вводить "Адмін", то promt запитує пароль.Якщо нічого не введено або натиснута клавіша Esc,
//     вивести рядок "Відмінено"
//     У іншому випадку вивести рядок "Я вас не знаю!"

// Пароль перевіряти так:
// якщо введено пароль "Я головний", то вивести "Вітаю!",
//     у іншому випадку виводити рядок "Невірний пароль!".

// let enterLogin = prompt('Enter login');

// if (login === "Адмін") {
//     password = promt('Enter login');
//     if (password = "Я головний")
//     {console.log(alert("Вітаю!"))}
//     else {console.log(alert("Невірний пароль!));
//     }
// }


// 8. У змінній  min лежить число від 0 до 59.
// Потрібно визначити, в яку чтверть години потрапить це число(в першу, другу, третю або четверту)

// let min = 25;
// if (min >= 0 && min <= 14) {
//     console.log("Перша чверть");
// }
// else if (min >= 15 && min <= 29) {
//     console.log("Друга чверть");
// }
// else if (min >= 30 && min <= 44) {
//     console.log("Третя чверть");
// }
// else if(min >= 45 && min <= 60) {
//     console.log("Четверта чверть");
// }

// 9. Дано рядок, який складається із символів.Наприклад, 'abcde'.
//     Перевірте, що першим символом цього рядка є літера 'a'.
//  Якщо це так - вивести "так", у іншому випадку вивести "ні"

// const string = 'abcde';
// function checkLetter(str) {
//     // console.log(string)
//     if (str[0] === 'a') {
//     console.log("Так")
// }else {console.log("Ні")}
// }

// const string2 = 'рbcde';
// checkLetter(string);
// checkLetter(string2);





// Використовуючи if..else, напишіть код, що отримує число за допомогою prompt і потім виводить повідомлення alert:

// 1, якщо значення більше нуля,
// -1, якщо меньше нуля,
// 0, якщо дорівнює нулю.
// У цьому завданні ми припускаємо, що введенне значення завжди є числом.

// let number = prompt('');

// if (number > 0) {
//     alert(1)
// } else if (number < 0){
//        alert(-1)
// }
// else {
//        alert(0)
// }


// Перепишіть конструкцію if, використовуючи умовний оператор '?':

// let result = (a + b < 4) ? result = 'Нижче' : result = 'Вище';


// Перепишіть if..else, використовуючи декілька тернарних операторів '?'.

// Для зручності читання рекомендується розділити код на кілька рядків.

// let message;

// if (login == 'Працівник') {
//   message = 'Привіт';
// } else if (login == 'Директор') {
//   message = 'Вітаю';
// } else if (login == '') {
//   message = 'Немає логіну';
// } else {
//   message = '';
// }


// let message = login == 'Працівник' ? message = 'Привіт' : message = '';
// login == 'Директор' ? message = 'Вітаю' : message = '';
// login == '' ? message = 'Немає логіну' : message = '';

// Напишіть код, виконавши завдання з кожного пункту окремим рядком:

// Створіть порожній об’єкт user.
// Додайте властивість name зі значенням Іван.
// Додайте властивість surname зі значенням Сміт.
// Змініть значення name на Петро.
// Видаліть властивість name з об’єкта.
// let user = {};
// user.name = "Іван";
// user.surname = "Сміт";
// user.name = "Петро";
// delete user.name;